Revit 2027 API
Material.SetMaterialAspectByPropertySet Method
 Sets an aspect of the material to a shared property set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetMaterialAspectByPropertySet(
	MaterialAspect aspect,
	ElementId propertySetId
)
Public Sub SetMaterialAspectByPropertySet (
	aspect As MaterialAspect,
	propertySetId As ElementId
)
public:
void SetMaterialAspectByPropertySet(
	MaterialAspect aspect,
	ElementId^ propertySetId
)
member SetMaterialAspectByPropertySet :
        aspect : MaterialAspect *
        propertySetId : ElementId -> unit
Parameters
aspect MaterialAspect
 The material aspect.
propertySetId ElementId
 Identifier of a shared property set (an instance of PropertySetElement).
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
Material Class
Autodesk.Revit.DB Namespace